Revit 2024 API
ConnectorSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ConnectorSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ConnectorSetIterator
Visual C++
public:
virtual ConnectorSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
ConnectorSet Class
Autodesk.Revit.DB Namespace